InformationRegisters/ГАЛ_ЦветаМетокФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ГАЛ_ЦветаМетокФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>R</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>G</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>B</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГАЛ_СтатусыЗаявокНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ГАЛ_СтатусыЗаявокНаДоставку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеЦветаМетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>R</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>G</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонEMAIL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГАЛ_ЦветаМетокФизЛиц/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	RGB = ПолучитьАбсолютныйЦвет(НашЦвет);
	Запись.R = RGB.Красный;
	Запись.G = RGB.Зеленый;
	Запись.B = RGB.Синий;
	//Объект.ЗначениеЦвета = RGB;
КонецПроцедуры


Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) Экспорт
	
	
	
	Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
		Возврат ИсходныйЦвет;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
	Каталог = КаталогВременныхФайлов();
	ТабДок.Записать(Каталог + "ПреобразованиеЦвета.mxl", ТипФайлаТабличногоДокумента.MXL7);
	ТабДок.Прочитать(Каталог + "ПреобразованиеЦвета.mxl");
	
	АЦвет = ТабДок.Область("R1C1").ЦветФона;
	
	Возврат АЦвет;

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекЦвет = Новый Цвет(Запись.R,Запись.G,Запись.B);
	НашЦвет = ТекЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеЦветаМеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СписокВыбора = ЗначениеЦветаНачалоВыбораСервер();
	
	 
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, );
		ПоказатьВыборИзСписка(Оп, СписокВыбора, Запись.ЗначениеЦветаМетки);


КонецПроцедуры

&НаСервере
Функция  ЗначениеЦветаНачалоВыбораСервер()
	
	Макет = Справочники.ГАЛ_СтатусыЗаявокНаДоставку.ПолучитьМакет("ЦветаМетки");	
	СписокВыбора = Новый СписокЗначений;
	Строк=7;
	НСтр=1;
	Для НомерСтроки=0 по (Строк-1) цикл
			СписокВыбора.Добавить(Макет.Область(НСтр, 1).Текст,Макет.Область(НСтр, 3).Текст,,Макет.Область(НСтр, 2).Картинка);
			НСтр=НСтр+1;
	КонецЦикла;

	Возврат СписокВыбора;  
КонецФункции


&НаКлиенте
Процедура ВыполнитьПослеВыбора(ЗначениеВыбора, ДопПараметры) Экспорт 
	
	//Запись.ЗначениеЦветаМетки = ЗначениеВыбора.Значение;
		
	//Цвет = WebЦвета[Объект.ЗначениеЦвета];
КонецПроцедуры

&НаКлиенте
Процедура НашЦветОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	RGB = ПолучитьАбсолютныйЦвет(НашЦвет);
	Запись.R = RGB.Красный;
	Запись.G = RGB.Зеленый;
	Запись.B = RGB.Синий;

КонецПроцедуры
